[
  {
    "id": 716863,
    "question_text": "A fruit vendor has two baskets of fruits. In the first basket, 20% of the fruits are apples, and in the second basket, 60% of the fruits are apples.  Together, the baskets must contain at least 300 apples to meet the daily requirement. Which inequality shows this relationship, where x is the total number of fruits in the first basket and y is the total number of fruits in the second basket?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 284992,
    "question_text": "Sarah is buying notebooks and pens for school. Notebooks cost $2.50 each and pens cost $1.50 each. She wants to spend less than $18 in total. Which of the following inequalities represents this situation, where n is the number of notebooks Sarah buys and p is the number of pens she buys?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 310670,
    "question_text": "A fruit vendor sells baskets of oranges. Each basket contains at least 25 oranges but no more than 35 oranges. Which of the following could be the total number of oranges on 6 baskets of oranges?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 167406,
    "question_text": "A student worked 20, 25, and 15 hours in the first three weeks at a part-time job. Solving which inequality gives the number of hours, H, the student must work in the fourth week to have an average of at least 22 hours per week for all four weeks?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 794539,
    "question_text": "To earn a 'Bronze' medal in a robotics competition, a team's robot must complete the obstacle course in more than 25 seconds but less than or equal to 30 seconds. If Team Alpha earned a 'Bronze' medal, which of the following could have been their robot's completion time in seconds?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 354787,
    "question_text": "A coffee shop sells small coffees for $2 and large coffees for $4.  During the morning rush, the barista wants to ensure that the total revenue from coffee sales is at least $60. If the barista sells x small coffees and y large coffees, which of the following inequalities must be true?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 668608,
    "question_text": "A bakery is making cookies and cakes for a school event. Let $x$ be the number of cookies and $y$ be the number of cakes. They need to make at least 50 items in total, but the total baking time should be no more than 120 minutes. Each cookie takes 2 minutes to bake and each cake takes 5 minutes to bake. Which of the following systems of inequalities models this situation?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 722898,
    "question_text": "A taxi service charges a flat fee of $3 plus $2.50 per mile driven. Michael wants to spend no more than $28 on a taxi ride. If the distance is measured in whole miles, what is the maximum number of miles Michael can travel in the taxi?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 545539,
    "question_text": "A hardware store needs to stock up on boxes of nails for the upcoming week. They estimate they will need at least 200 boxes of nails. Nails are sold in cartons, where each carton contains 24 boxes of nails. What is the minimum number of cartons of nails the hardware store needs to purchase to meet their estimated need?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 258502,
    "question_text": "A certain chemical reaction is most effective when the temperature is between 25 degrees Celsius and 40 degrees Celsius, inclusive. Which inequality represents this situation, where $t$ is the temperature in degrees Celsius for the reaction to be most effective?",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 56955,
    "question_text": "A delivery truck is transporting two types of boxes: small boxes weighing 30 pounds each and large boxes weighing 50 pounds each.  For each delivery, the truck must carry at least 12 boxes, and the total weight of the boxes cannot exceed 600 pounds. What is the maximum number of large boxes that the truck can carry per delivery?",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 731832,
    "question_text": "A bakery is making cookies and cakes for a large order. They need to make at least 50 items in total. Cookies require 10 minutes of preparation time each, and cakes require 25 minutes of preparation time each. The bakery has a maximum of 15 hours (900 minutes) of preparation time available. They must make at least 20 cookies and at least 10 cakes. Which of the following systems of inequalities represents these conditions, if $x$ is the number of cookies and $y$ is the number of cakes?",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 544509,
    "question_text": "A shipping company uses cylindrical containers to transport goods. The standard diameter of a container must be at least 4 feet and no more than 5 feet. A cargo ship has a storage bay that is 60 feet wide.  The containers are to be placed side-by-side along the width of the storage bay. Let $n$ be the number of containers that can be placed in a row across the width of the storage bay. Which of the following describes all the possible values of $n$?",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 590518,
    "question_text": "Which of the following ordered pairs (x, y) is a solution to the system of inequalities below?  $$y \\ge x + 1$$ $$y \\le -x - 1$$",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 678892,
    "question_text": "A certain plant is 5 inches tall when planted and grows more than 0.5 inch but less than 0.75 inch per week. Which of the following inequalities represents all possible heights $h$, in inches, for the plant 52 weeks after being planted?",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 443293,
    "question_text": "A coffee shop estimates that on a typical weekday, they sell between 350 and 400 cups of coffee before noon. Based on this estimate, which inequality represents the possible total revenue, in dollars, from coffee sales before noon on a weekday if each cup of coffee costs $3?",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 338771,
    "question_text": "A small business currently spends $1,500 per year on traditional light bulbs. The owner is considering switching to LED bulbs, which would cost $4,800 to install but are estimated to reduce the annual lighting cost to $900.  Which of the following inequalities can be solved to find t, the number of years after installation at which the total amount of electricity cost savings will exceed the installation cost?",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 122107,
    "question_text": "Which of the following ordered pairs (x, y) satisfies the system of inequalities below?\\n$$y > -2x + 3$$\\n$$x + y \\le 4$$",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 661631,
    "question_text": "The formula to convert Celsius (C) to Fahrenheit (F) is $F = \\frac{9}{5}C + 32$. The Fahrenheit temperature in a refrigerator must be at most 41 degrees Fahrenheit. Which inequality represents the condition for the Celsius temperature? Let C be the Celsius temperature.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 313507,
    "question_text": "Maria's office is a 25-minute bike ride or a 10-minute car drive away from her home. The traffic light cycle is such that the waiting time at traffic lights, t, in minutes, varies between 0 and 20. Which of the following inequalities gives the values of t for which it would be faster for Maria to bike to office?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 957984,
    "question_text": "A craft store is making bracelets and necklaces to sell at a fair. Each bracelet requires 20 beads and each necklace requires 50 beads. The store has a total of at most 1000 beads available. The store wants to make at least twice as many bracelets as necklaces. Let $b$ represent the number of bracelets and $n$ represent the number of necklaces, where $b$ and $n$ are nonnegative integers. Which of the following systems of inequalities best represents this situation?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 652938,
    "question_text": "A car rental company charges a base daily rate of $d dollars, plus an additional charge of $0.10 for each mile driven. A customer wants to rent a car for a day and wants the total cost to be at least 1.5 times and at most 2 times the base daily rate. Which of the following inequalities represents all possible values of the number of miles, $m$, the customer can drive in a day to meet this cost goal?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 620261,
    "question_text": "A number $p$ is at least 5 more than twice the value of $q$. If the value of $q$ is 3, what is the least possible value of $p$?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 718896,
    "question_text": "A sales manager at a technology company organized a training program to improve the sales performance of her team. The team consists of 200 sales representatives, divided into two groups of 100 for the training. In the first group of 100 representatives, 45 achieved their sales target after the training. In the second group of 100 representatives, q representatives achieved their sales target after the training. If more than 30% of all sales representatives achieved their sales target after the training, which of the following inequalities best describes the possible values of q ?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 584145,
    "question_text": "The triangle inequality theorem states that the sum of the lengths of any two sides of a triangle must be greater than the length of the third side.  If a triangle has side lengths of 5 and 9, which inequality represents the possible lengths, $y$, of the third side of the triangle?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 72914,
    "question_text": "A theme park charges an entrance fee of \\$15 per person and an additional \\$4 per ride. Sarah wants to spend no more than \\$55 in total at the theme park. If $r$ represents the number of rides Sarah can go on, which of the following inequalities represents the situation, and what is the greatest number of rides Sarah can go on?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  },
  {
    "id": 672959,
    "question_text": "A shipping service restricts the dimensions of the boxes it will ship for a certain type of service. The restriction states that for boxes shaped like rectangular prisms, the sum of the perimeter of the base of the box and the height of the box cannot exceed 150 inches. The perimeter of the base is determined using the width and length of the box. If a box has a height of 40 inches and its length is 2.5 times the width, which inequality shows the allowable width x, in inches, of the box?",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Math",
    "category": "Algebra",
    "subcategory": "Linear Inequalities",
    "subject_id": 1,
    "category_id": 2,
    "subcategory_id": 17
  }
]