[
  {
    "id": 87940,
    "question_text": "Many traditional brick-and-mortar stores have struggled to compete with online retailers that offer lower prices and greater convenience. __________, some physical stores are adapting by focusing on experiential retail, providing customers with unique in-store experiences like workshops or personalized services.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 955625,
    "question_text": "Many ancient civilizations relied heavily on astrology, believing that celestial events could predict earthly occurrences. ____________________, the Babylonians developed sophisticated astronomical observations and mathematical models, aiming to interpret the will of the gods through the movements of the stars and planets.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 243780,
    "question_text": "Studies have shown that regular physical exercise is crucial for maintaining good health, improving cardiovascular function, and boosting mood.  ______, individuals who incorporate consistent physical activity into their routines often experience enhanced sleep quality and increased energy levels throughout the day.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 433218,
    "question_text": "Scientists studying the effects of climate change on ecosystems are increasingly focusing on the Amazon rainforest. The Amazon plays a crucial role in global carbon cycling and biodiversity.  __________, researchers are developing advanced monitoring systems to track deforestation and changes in vegetation health across this vast region.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 799974,
    "question_text": "Many cultures value storytelling as a way to pass down traditions and knowledge across generations.  Oral storytelling, in particular, relies on memory and performance to engage listeners.  ______,  written language has provided a more permanent method for preserving narratives, allowing stories to reach wider audiences and endure over longer periods.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 217589,
    "question_text": "Johannes Gutenberg's printing press revolutionized the dissemination of information in Europe during the 15th century. _________________________, before Gutenberg's invention, books were painstakingly handwritten, making them expensive and inaccessible to most people.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 429903,
    "question_text": "Maya is learning to play the guitar. She practices chords and scales for at least thirty minutes each day. ________, she listens to her favorite guitarists to learn different playing styles.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 774795,
    "question_text": "Many birds build nests in trees or bushes to protect their eggs and young. First, they gather twigs, leaves, and other materials. __________________________, they carefully weave these materials together to form a secure structure.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 482271,
    "question_text": "Many gardeners appreciate the beauty of roses and their delightful fragrance. \\_\\_\\_\\_\\_, cultivating roses can be challenging, as these plants are susceptible to diseases and require diligent pruning and care to thrive.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 768858,
    "question_text": "In 1969, the Apollo 11 mission successfully landed the first humans on the Moon, a feat of engineering and human endeavor celebrated globally. ___________________________________________________________________________________________________________________________________, the Soviet Union had achieved the first unmanned landing on the Moon with Luna 9 in 1966, a technological milestone often overshadowed by the later crewed landing.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 530525,
    "question_text": "In a study of urban bee populations, researchers first identified several green spaces within a city. __________________________________________________________________________ they meticulously cataloged the species and number of bees found in each location over a six-month period.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 783171,
    "question_text": "Many students find it challenging to concentrate for extended periods while studying. _________, they often employ techniques like the Pomodoro method, which involves focused work intervals followed by short breaks. This approach helps to maintain concentration and prevent mental fatigue during study sessions.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 854250,
    "question_text": "The processing speed of computers has increased dramatically over the decades. For instance, a computer from the 1980s might have performed a few million calculations per second. ______________________________________________________________________________________________________________________________________________ a modern smartphone can perform billions of calculations per second.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 261436,
    "question_text": "In recent years, the popularity of vinyl records has experienced a surprising resurgence.  For decades, digital music formats dominated the market, and vinyl records were relegated to niche collectors and enthusiasts.  ___, a new generation of listeners, alongside returning audiophiles, has embraced the warm sound and tactile experience of vinyl, leading to increased sales and a renewed interest in record players.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 809833,
    "question_text": "Studies have shown that the blue light emitted from electronic devices can interfere with the production of melatonin, a hormone that regulates sleep. __________ many sleep experts recommend avoiding screen time at least an hour before going to bed.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 23480,
    "question_text": "Researchers studying the impact of screen time on sleep discovered a correlation between evening social media use and sleep disturbances. Individuals who spent more than two hours on social media in the hour before bed reported experiencing difficulty falling asleep. _________, those who limited their evening social media use reported better sleep quality.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 918600,
    "question_text": "In 1928, Alexander Fleming discovered penicillin accidentally while studying influenza. __________, large-scale production of penicillin began during World War II, saving countless lives.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 946730,
    "question_text": "The cello, a prominent member of the string family, is known for its rich, resonant tone. _________, skilled cellists can produce sounds ranging from deep, somber lows to bright, singing highs, showcasing the instrument’s broad expressive capabilities.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 903444,
    "question_text": "The impact of artificial intelligence (AI) on various industries is becoming increasingly evident. _________________________________________________________________________________________________________________________ AI is now being implemented in fields ranging from healthcare and finance to transportation and education.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 586083,
    "question_text": "Dr. Aris Thorne, a marine biologist, was deeply concerned about the impact of plastic pollution on ocean ecosystems. _____ he initiated a long-term study analyzing microplastic accumulation in various marine species in the Pacific Ocean.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 146539,
    "question_text": "The Renaissance was a period of renewed interest in classical art and learning.  ____, the Baroque era, which followed, embraced dramatic and ornate styles that diverged significantly from Renaissance ideals. This shift is evident in architecture, painting, and music, marking a distinct change in European artistic expression.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 774122,
    "question_text": "Many people believe that listening to music while studying enhances focus and concentration.  _____ , research indicates that for some individuals, background music can be distracting, particularly when the music has lyrics or is unfamiliar.  These distractions can divide attention and hinder cognitive performance, ultimately making studying less effective.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 907006,
    "question_text": "Early studies suggested that moderate coffee consumption could slightly elevate blood pressure. ______, more recent and extensive research indicates that for most people, this effect is minimal and temporary, with the long-term benefits of coffee potentially outweighing this minor risk.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 60352,
    "question_text": "Many cities around the world are implementing innovative solutions to reduce traffic congestion. ______ , some cities have introduced congestion pricing, charging drivers a fee to enter the city center during peak hours.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 286251,
    "question_text": "Botanists have long debated the role of scent in plant communication. Some research suggests that floral fragrances primarily function to attract pollinators, guiding bees and other insects to nectar-rich blossoms.  ____, recent studies indicate that plants can also emit airborne chemical signals to warn neighboring plants of herbivore attacks, triggering defensive responses in the recipients. ",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 196954,
    "question_text": "The relentless advancement of microchip technology has led to exponential increases in computing power. _______________________, personal computers today are not only significantly faster but also dramatically smaller than their predecessors.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 919532,
    "question_text": "The ancient Greeks made significant advancements in mathematics, including Euclid's development of geometry and Archimedes's calculations of areas and volumes.  _____, their contributions extended to astronomy, with figures like Ptolemy creating models of the solar system that, while geocentric, influenced astronomical thought for centuries.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 127016,
    "question_text": "In 2010, it was estimated that online sales constituted approximately 8% of total retail sales in the United States. _____ , e-commerce accounts for roughly 20% of all retail sales.",
    "image_url": null,
    "difficulty": "Easy",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 991328,
    "question_text": "The advent of social media platforms has undeniably broadened avenues for individuals to connect, fostering relationships across vast geographical distances.  \\_, the richness of nonverbal communication and the nuances of in-person dialogue can be significantly reduced when interactions are primarily mediated through digital interfaces.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 131895,
    "question_text": "Initially, researchers believed that the newly discovered exoplanet Kepler-186f, located within its star's habitable zone, would be remarkably similar to Earth. It was assumed to have a similar atmospheric composition and surface temperature, fostering hopes for potential life. ____________________________________________________________________________________________________, further analysis revealed significant differences, including a potentially tidally locked orbit and a less dense atmosphere than initially predicted.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 466656,
    "question_text": "Researchers have long observed a correlation between socioeconomic status and access to healthy food options. Individuals in higher income brackets often have greater access to supermarkets stocked with fresh produce and organic goods. ___________________________________________________________________________________________________________________________________ those in lower income brackets may primarily rely on convenience stores or fast-food outlets, which typically offer fewer nutritious choices.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 846161,
    "question_text": "Many ancient cultures developed sophisticated systems for tracking time based on celestial observations. The Maya, for instance, created a complex calendar system with remarkable accuracy; __________, ancient Egyptians relied on the annual flooding of the Nile River to regulate their agricultural and civic life.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 623566,
    "question_text": "Botanist Maria Merian was renowned for her meticulous illustrations of plants and insects.  Traveling to Suriname in 1699, she defied societal expectations for women of her time to study and document the region's flora and fauna.  Her detailed engravings, published in \\",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 766366,
    "question_text": "Many popular weight-loss diets focus on reducing carbohydrate intake. The ketogenic diet, , drastically restricts carbohydrates to induce a metabolic state called ketosis. The Paleo diet,  limits grains and processed foods, but allows for moderate carbohydrate consumption from fruits and vegetables.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 723503,
    "question_text": "Many historical accounts suggest that the Library of Alexandria was the largest and most significant library of the ancient world, housing a vast collection of scrolls and attracting scholars from across the Mediterranean.  ______, recent archaeological findings in Egypt have unearthed evidence of other substantial libraries predating or contemporary with Alexandria, challenging its presumed uniqueness.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 279316,
    "question_text": "The average global temperature has been steadily rising over the past century. Scientists attribute this warming trend primarily to the increase in greenhouse gas emissions from human activities such as burning fossil fuels and deforestation. ________________________________________________________________________________________________________________________________________________________________ rising sea levels, more frequent extreme weather events, and disruptions to ecosystems are becoming increasingly apparent.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 326618,
    "question_text": "While artificial intelligence (AI) offers numerous benefits, such as increased efficiency and automation, it also presents potential downsides. AI systems can perpetuate biases present in their training data, leading to unfair or discriminatory outcomes. ________, the increasing reliance on AI in various sectors raises concerns about job displacement and the need for workforce adaptation.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 143851,
    "question_text": "To understand ancient trade routes in the Mediterranean, archaeologist Dr. Anya Sharma analyzes pottery shards found at various coastal sites. ________ she examines surviving written records from the period, as these documents often detail the goods and ships involved in trade.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 798785,
    "question_text": "A recent study by Dr. Emily Carter and colleagues explored the effects of regular physical activity on cognitive abilities in adults over the age of 65. ____________________________________________________________________________________________________________________________________, they examined participants’ performance on memory tests and problem-solving tasks both before and after a six-month exercise program.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 759834,
    "question_text": "For much of the 19th century, academic painting emphasized realism and historical subjects, often with highly detailed and polished finishes. Critics and the public largely valued these traditional styles. ____, artists began to experiment with capturing fleeting moments and impressions of light and color, leading to the Impressionist movement.",
    "image_url": null,
    "difficulty": "Medium",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 840854,
    "question_text": "Traditional economic models often prioritize Gross Domestic Product (GDP) growth as the key metric for assessing a nation's economic health. ________, some economists argue that focusing solely on GDP can be misleading, as it may mask significant disparities in income distribution across the population. These economists contend that a more equitable distribution of wealth is a better indicator of overall societal progress.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 166434,
    "question_text": "Many cities are facing increasing population density. _______, urban planners are exploring vertical urbanism as a solution.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 624019,
    "question_text": "Many anticipated that the ambitious urban renewal project would rapidly revitalize the city's downtown area. _____________________, unexpected delays and budget overruns plagued the development, pushing back the completion date by several years and significantly altering the initial vision.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 983095,
    "question_text": "Economists once believed that consumer spending was primarily driven by immediate income levels.  This theory suggested that individuals would adjust their spending in direct response to any changes in their current earnings.  ________________,  modern economic thought recognizes that consumer behavior is significantly influenced by expectations of future income and long-term financial security, not just present earnings.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 267871,
    "question_text": "Many expected that the rise of remote work would uniformly improve employee well-being and productivity. Companies invested heavily in remote infrastructure, anticipating significant gains across various metrics. __________, research on remote work's impact has revealed a more nuanced reality, with some studies showing increased productivity in certain sectors while others highlight challenges in maintaining team cohesion and work-life balance.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 386090,
    "question_text": "While some studies suggest that moderate coffee consumption may have health benefits, particularly in reducing the risk of type 2 diabetes, excessive intake can lead to adverse effects like anxiety and insomnia.  __________________________, individuals with pre-existing heart conditions are often advised to limit or avoid caffeine altogether due to its potential to elevate heart rate and blood pressure.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 767564,
    "question_text": "Researchers studying the impact of urban green spaces on mental health examined data from several major cities. They found a strong correlation between the amount of green space in a neighborhood and residents' reported stress levels. ____________________________________________________________________________________________________________________________________________________________________, the study also revealed that access to green spaces was not equitably distributed across socioeconomic groups within these cities.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 685871,
    "question_text": "In recent years, the popularity of podcasts has surged dramatically.  Listeners appreciate their on-demand nature and the diverse range of topics available, from true crime to historical analysis.  ________, podcasts have become a significant force in media consumption, rivaling traditional radio and even television in certain demographics.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 77996,
    "question_text": "While massive stars, burning fuel at an extraordinary rate, exhaust their reserves in a relatively short time, leading to lifespans of only a few million years; ______________________________________________________________________________________________________________________________________________ stars like red dwarfs, with their slow burn and minimal fuel consumption, can shine for trillions of years.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 243913,
    "question_text": "Early studies suggested that the newly discovered exoplanet, Kepler-186f, might be remarkably similar to Earth in size and temperature, raising hopes for potentially habitable conditions. ______________________________________________________________________________________________________________________ further data revealed that its atmospheric composition and stellar radiation environment are significantly harsher than initially anticipated, making the prospect of life as we know it on Kepler-186f less likely.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 186504,
    "question_text": "Many studies suggest that dark chocolate, rich in antioxidants, may offer certain health benefits, such as improved cardiovascular function. __________, it is crucial to remember that chocolate, even dark chocolate, is also calorie-dense and should be consumed in moderation as part of a balanced diet.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 723297,
    "question_text": "Economists once believed that a strong correlation existed between increased coffee consumption and heightened productivity.  _____, recent studies, employing larger sample sizes and more rigorous methodologies, have revealed that this correlation is not statistically significant, suggesting other factors play a more crucial role in workplace output.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 178479,
    "question_text": "The study of history often focuses on the analysis of written documents and archaeological evidence. Anthropology, __________, frequently relies on participant observation and ethnographic fieldwork to understand human cultures.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  },
  {
    "id": 729960,
    "question_text": "While digital communication offers unprecedented convenience, it can also subtly erode traditional forms of social interaction. For example, face-to-face conversations, once the cornerstone of community building, are increasingly being replaced by text messages and social media posts. ____, some sociologists argue that this shift towards digital interaction may contribute to feelings of isolation and a weakening of social bonds.",
    "image_url": null,
    "difficulty": "Hard",
    "subject": "Reading & Writing",
    "category": "Expression of Ideas",
    "subcategory": "Transitions",
    "subject_id": 4,
    "category_id": 9,
    "subcategory_id": 37
  }
]